# sequencing - Sequencing პითონში ნიშნავს, რომ კოდი სრულდება ზემოდან ქვემოთ, ნაბიჯ-ნაბიჯ, იმავე რიგით, როგორც დაწერილია.

# interation - Iteration პითონში ნიშნავს კოდის ერთსა და იმავე ნაწილის მრავალჯერ შესრულებას.

# seleection - Selection პითონში ნიშნავს გადაწყვეტილების მიღებას პროგრამაში — როცა პროგრამა ირჩევს, რომელი შეასრულოს სხვადასხვა სიტვაციის მიხედვით.

# flowchart - Flowchart პითონში ნიშნავს დიაგრამას, რომელიც აჩვენებს როგორ მიმდინარეობს პროგრამის ნაბიჯები და ლოგიკა სიმბოლოებით და ისრებით.