# num1 = int(input("enter your number: ")) #1
# num2 = int(input("enter your number: ")) #2
# num3 = int(input("enter your number: ")) #3
# print((num1 + num2 + num3) // 3)



# num1 = int(input("enter your first number: ")) #1
# num2 = int(input("enter your second number: ")) #2
# print((num1 + num2) // 3)


#string --> ტექსტური მონაცემი, ასევე ეგრეწოდებული ბრჭყალებს შორის მოქცეული ნებისმიერი მნიშვნელობა. პითონს სტრინგებთან შორის დამოკიდებულება აქვს ასეთი : უბრალოდ წარმოიდგენს მათ როგორც ტექსტი, მეტი არაფერი.

#integer --> მთელი რიცხვი, ხოლოს პითონი მათ წარმოიდგენს როგორც რიცხვი მაგრამ იმ შემთხვევაში თუ ჩვენ რიცხვი ჩავწერეთ ბრჭყალებში, პითონი წარმოდგენს ამ რიცხვს როგორც სტრინგი ანუ ტექსტურო მონაცემი, და ამ რიცხვით ჩვენ ვერ შევძლებთ გამოთვლების გაკეთებას.

#float --> ათწილადი, float და integer განსხვავდებიან ერთმანეთისგან, ერთი არის მტელი რიცხვი მეორე არის ათწილადი, ხოლო როგორც ინტეჯერზე ვთქვით რომ ბრჭყალებში გახდება სტრინგი და პითონი აღიქვამს ამ ინტეჯერს ტექსტურ მონაცემად, ისე იქნება ათწილადზეც.

#bool --> შეიცავს ორ მნიშვნელობას, ეს არის True და False, ანუ ჭეშმარიტი და მცდარი, ამათი მნიშვნელობა გამოდის, მაგ. and და or ის დროს, შედარების ოპერატორების დროს, ესეც მაგალითად იქნება:

#print(2 > 5) False
#print(2 <= 2 and 2 >= 5) False




DAD = input("ჩაწერე შენი პირველი ოჯახის წევრის სახელი: ")
MOM = input("ჩაწერე შენი მეორე ოჯახის წევრის სახელი: ")
Mari = input("ჩაწერე შენი მესამე ოჯახის წევრის სახელი: ")
Salome = input("ჩაწერე შენი მეოთხე ოჯახის წევრის სახელი: ")
Oto = input("ჩაწერე შენი მეხუთე ოჯახის წევრის სახელი: ")
Nika = input("ჩაწერე შენი მექვსე ოჯახის წევრის სახელი:")


print(DAD + "" +  MOM + " " +  Mari + " " +  Salome + " " + Oto + " " + Nika)