# data type - მონაცემთა ტიპები.

# string - ნებისმიერი მნიშვნელობა, რომელიც იქნება მოთავსებული "" -  ბრჭყალებს შორის.
print("Oto")
print("group 84")

# integer - ნებისმიერი მთელი რიცხვი python-ში.
print(100)
print(84)

# float - ნებისმიერი ათწილადი რიცხვი python-ში.
print(10.2)
print(84.2)


# ცვლადის შექვნის წესები.

# ცვლადის დეკლარაცია --> ცვლადის შექმნა.
# ცვლადის რეინიციალიზაცია --> ცვლადის მნიშვნელობის განახლებას.

# 1) ცვლადს აუცილებლად ვუფიქრებთ დასახელებას.
# 2) ცვლადის დასახელების შემდეგ აუცილებლად ვწერთ = ნიშანს.
# 3) ტოლობის შემდეგ ვანიჭებთ ცვლადს მნიშვნელობას.

# ცვლადში შეგვიძლია შევინახოთ ნებისმიერი მონაცემთა ტიპი. (string, integer, float)
# ცვლადის დასახელება აუცილებლად უნდა იწყებოდეს ასოებით და არა რიცხვებით, თორემ ეს გამოიტანს შეცდომას.

# ჩვენ შეგვიძლია დავბეჭდოთ რამდენიმე მნიშვნელობა ერთ print() ფუნქციაში, უბრალოდ უნდა გამოვიყენოთ ისინი მძიმეებით.

name = "Oto"
city = "Tbilisi"
age = "14"
number = 14.5

print(name, age, city, number)
print("ჩემი სახელია ოთო", 14)

name = "Oto"
print(name)
print(name)
print(name)

name = "Nika"
print(name)
print(name)
