# 1) დაატრიალეთ for ციკლი 0 დან 38 ის ჩათვლით და გამოიტანე თითოეული რიცხვი ტერმინალში 


for i in range(0,39):
    print(i)


# 2) დაატრილეთ for ციკლი 30 დან 40 მდე  და გამოიტანე თითოეული რიცხვი ტერმინალში 


for i in range(30,41):
    print(i)

 
# 3) დაატრიალეთ for ციკლი 12 იდან 120 მდე  და გამოიტანე თითოეული რიცხვი ტერმინალში 


for i in range(12,121):
    print(i)


# 4) დაატრიალეთ for ციკლი და გამოიტანეთ თქვენი სახელი 18 ჯერ ასევე გამოიტანეთ თქვენი ასაკიც,ერთ for ციკლში მოათავსეთ ორივე და ეგრე გააკეთეთ


for i in range(0,18):
    print("Oto",15)


# 5) დაატრიალეთ for ციკლი 10 დან 100 მდე 3 step ის გამოტოვებით და გამოიტანეთ თითოეული რიცხვი ტერმინალში


for i in range(10,101,3):
    print(i)


# 6) ტერმინალში გამოიტანეთ თქვენი საყვარელი ხილის სახელი 30 ჯერ და თან დანომრეთ, მიიღეთ ქვემოთ მოცემულის ნაირი შედეგი

# 1 ფორთოხალი
# 2 ფორთოხალი
# 3 ფორთოხალი
# 4 ფორთოხალი
# 5 ფორთოხალი
# .... 
# ....
# ....
# 30 ფორთოხალი


for i in range(0,31):
    print( i, "ვაშლი")


# 7) მომხმარებელს შემოატანინეთ მისი ასაკი 13 ჯერ გამოიყენე for loop


for i in range(0,14):
    print("15")


# 8) გამოიტანეთ თქვენი სახელი 10 ჯერ while loop ის გამოყენებით


num = 0

while num < 11:
    print(num)
    num += 1


# 9) დაითვალეთ 0 დან 24 მდე გამოიყენეთ while loop


number = 0


while number < 25:
    print(number)
    number += 1


# 10) იმუშაოვეთ ბევრი for და while loop ებზე მოიყვანეთ თქვენით მაგალითები სურვილისამებრ.


for i in range(0,251,3):
    print(i)

for i in range(50,151):
    print(i)

for i in range(100,351,2):
    print(i)


user = 0

while user < 51:
    print(user)
    user += 2

user1 = 50

while user1 < 102:
    print(user1)
    user1 += 3

user2 = 200

while user2 < 301:
    print(user2)
    user2 += 2