# print() --> ფუნქცია, რომელიც გამოიყენება იმისთვის რომ გამოვიტანოთ ჩვენი კოდის შედეგი.

# terminal არის ადგილი, სადაც შეგვიძლია ვნახოთ ჩვენი კოდის შედეგი.

# ნებისმიერი ტექსტური მნიშვნელობა აუცილებლად უნდა იყოს მოქცეული "" - ბრჭყალებს შორის.

# რიცხვები არ საჭიროებენ ბრჭყალებს, მაგრამ თუ მოვათავსებთ ბრჭყალებში რიცხვებს, ეგენი უკვე იქნებიან ტექსტური რიცხვები და არა ნამდვილი რიცხვები.

# comment - კომენტარი python-ში აღინიშნება # (დიეზით) და რასაც მასში დავწერთ კომპიუტერი მას ვერ აღიქვამს. კომენტარის ნახვა და წაკითხვა შეუძლია.
# მხოლოდ ადამიანებს, კომპიუტერი მას ვერ აღიქვამს

# ახალი სიტყვები -->

# syntax - კოდის წერის სწორი წესი. (მართლწერა)

# parentheses - ფრჩხილები ()

print('Oto')
print("Oto")

print("Hello it's me")

print(5)
print("5")

# შესრულებული დავალება -->

print("Oto")
print(14)
print("shemwvari kartofili tyemlit")