# 2) კომენტარების სახით ახსენით რა არის input-ი და output-ი, მოიყავნეთ შესაბამისი მაგალითები.

# 3) შექმენით ცვლადი, რომელშიც შეინხავთ input ინსტრუქციით შემოტანილ მნიშვნელობას, შემდეგ შეამოწმებთ თუ რა ტიპის მონაცემი ინახება ამ ცვლადში და დაპრინტავთ.

# 4) თიოთეული მონაცემთა ტიპისთვის (str,int,float), შექმენით 5 ცვლადი და დაუწერეთ კომენტარი თუ რომელ მონაცემთა ტიპს ინახავს ცვლადი.

# 5) აიღეთ 3 ცვლადი, შეინახეთ განსხავებული მონაცემთა ტიპები (str,int,float), შემდეგ type ინსტრუქციის გამოყენებით შეამოწმეთ, თუ რომელ მონაცემთა ტიპს ინახავს ცვლადი.

# 6) მომხმარებელს შემოატანინეთ ორი სიტყვა, შეინახეთ ისინი ცვლადებში, მოახდინეთ მათი კონკატინაცია და დაბეჭდეთ.

# 7) მომხმარებელს შემოატანინეთ 5 რიცხვი სხვადასხვა დამოუკიდებელი input-ების სახით, თქვენი დავალებაა დაბეჭდოთ მათი საშუალო არითმეტიკული.

# 8) მომხმარებელს შემოატანინეთ სახელი, გვარი, ასაკი, სიმაღლე, წონა და ამ მონაცემების გამოყენებით დაბეჭდეთ ერთი დიდი წინადადება.




# 2) კომენტარების სახით ახსენით რა არის input-ი და output-ი, მოიყავნეთ შესაბამისი მაგალითები.

# iput-ში მომხმარებელს შემოაქვს ინფორმაცია.

# output-ში კი მომხმარებლის ინფორმაცია ტერმინალში გვიჩანს.

# ---------------------------------------------------------------------------------------------------------------------------

# 3) შექმენით ცვლადი, რომელშიც შეინხავთ input ინსტრუქციით შემოტანილ მნიშვნელობას, შემდეგ შეამოწმებთ თუ რა ტიპის მონაცემი ინახება ამ ცვლადში და დაპრინტავთ.


a = input("enter your name: ")

print(type(a))

# ---------------------------------------------------------------------------------------------------------------------------

# 4) თიოთეული მონაცემთა ტიპისთვის (str,int,float), შექმენით 5 ცვლადი და დაუწერეთ კომენტარი თუ რომელ მონაცემთა ტიპს ინახავს ცვლადი.


a1 = input("enter your name: ") # ეს ცვლადი ინახავს str-ს ანუ სტრინგს (string).

b = int(input("enter your age: ")) # ეს ცვლადი ინახავს int-ს ანუ ინტეჯერს (integer).

c = float(input("enter your letter: ")) # ეს ცვლადი ინახავს float-ს ანუ ფლოატს (float).

# ---------------------------------------------------------------------------------------------------------------------------

# 5) აიღეთ 3 ცვლადი, შეინახეთ განსხავებული მონაცემთა ტიპები (str,int,float), შემდეგ type ინსტრუქციის გამოყენებით შეამოწმეთ, თუ რომელ მონაცემთა ტიპს ინახავს ცვლადი.


variable = input("enter your name: ")

print(type(variable))


variable1 = int(input("enter your letter: "))

print(type(variable1))


variable2 = float(input("enter your letter: "))

print(type(variable2))

# ---------------------------------------------------------------------------------------------------------------------------

# 6) მომხმარებელს შემოატანინეთ ორი სიტყვა, შეინახეთ ისინი ცვლადებში, მოახდინეთ მათი კონკატინაცია და დაბეჭდეთ.


word = input("enter your first word: ")

word1 = input("enter your second word: ")

print(word + word1)

# ----------------------------------------------------------------------------------------------------------------------------

# 7) მომხმარებელს შემოატანინეთ 5 რიცხვი სხვადასხვა დამოუკიდებელი input-ების სახით, თქვენი დავალებაა დაბეჭდოთ მათი საშუალო არითმეტიკული.


a2 = int(input("enter your letter: "))

b1 = int(input("enter your letter: "))

c1 = int(input("enter your letter: "))

d = int(input("enter your letter: "))

e = int(input("enter your letter: "))

print((a2 + b1 + c1 + d + e) / 5)

# ------------------------------------------------------------------------------------------------------------------------------

# 8) მომხმარებელს შემოატანინეთ სახელი, გვარი, ასაკი, სიმაღლე, წონა და ამ მონაცემების გამოყენებით დაბეჭდეთ ერთი დიდი წინადადება.


name = input("enter your name: ")

surname = input("enter your surname: ")

age = input("enter your age: ")

height = input("enter your height: ")

weight = input("enter your weight: ")

print(name, ",",  surname, ",",  age, ",",  height, ",", weight )
