# 2) კომენტარებით ახსენით რა არის სია და როგორ უნდა შევქმნათ ის(მოიყვანეთ მაგალითით შექმენით ნებისმიერი სია)

#სიის მეშვეობით ჩვენ შეგვიძლია შევქმნათ დალაგებული სია და შევიტანოთ შიგნით ჩვენი სასურველი მნიშვნელობები, ხოლოს შექმნას რაც შეეხება, ჯერ უნდა დავარქვათ სიას და მერე ვხსნით კვადრატულ ფრჩხილებს, სადაც შევიტანთ მნიშვნელობებს,(არ აქვს მნიშვნელობა რა მონაცემთა ტიპია)

cars = ["BMW", "porsche", "mercedes", "ferrari"]



# 3) კომენტარებით ახსენით რა არის ინდექსი.
#სიის ყოველივე ელემენტს აქვს ინდექსი, და ინდექსი წარმოადგენს ელემენტის მდებარეობას.

# 4) შექმენით 7 ელემენტიანი სახელების სია, შეცვალეთ 1-ლი და მე-5 ინდექსზე მდგომი ელემენტების მნიშვნელობა.

names = ["oto", "gio", "nika", "andria", "shavidze", "daviti", "nika bejashvili"]
names[1] = "nia"
names[5] = "nia"
print(names)


# 5) შექმენით სია და შეიტანეთ შიგნით სხვადასხვა ელემენტები და გამოიტანეთ მე-2 ,მე-4 და მე-6 ელემენტები და ახსენით როგორ გამოგაქვთ.

numbers = [1,2,3,4,5,6,7,8,9,10]
print(numbers[2])
print(numbers[4])
print(numbers[6])

# 6) ლისტს და ცვლადს შორის განსხვავება ახსენით ასევე კომენტარებით.

number = 10
list = [1,2,3,4,5,6,7,342,24,55,2,432,424]
print(number)

#ცვლადი არის დასახელებული მაჩვენებელი, რომელიც მიუთითებს მეხსიერებაში არსებულ ერთ ობიექტზე, ხოლო მასივი არის კოლექციის სტრუქტურა, რომელიც აერთიანებს მრავალ მონაცემთა ელემენტს ერთი სახელის ქვეშ.