# 1) შექმენით 5 ელემენტიანი სია, სადაც ჩაწერთ თქვენს საყვარელი მანქანების სახელს. ბოლოს გამოიტანეთ სიაში მყოფი პირველი და მესამე მნიშვნელობა.

arr1 = ["Chevrolet Corvette", "Porsche 718 cayman", "Porsche 718 Boxster", "The BMW 4 Series Coupe", "Toyota GR Supra"]

print(arr1[1])
print(arr1[3])

# 2) შექმენით რიცხვების სია, სადაც ჩაწერთ 0-დან 10-ის ჩათვლით ყველა ლუწ რიცხვს. ბოლოს გამოიტანეთ სიაში მყოფი მეორე და მეოთხე მნიშვნელობა.

arr2 = [0,2,4,6,8,10]

print(arr2[2])
print(arr2[4])

# 3) შექმენით 5 ელემენტიანი სია და დაბეჭდეთ მისი მე-4 ელემენტი.

arr3 = ["Porsche 911", "Porsche 911 GT3 / GT3 RS", "Porsche 911 Turbo", "McLaren Artura", "McLaren GT"]

print(arr3[4])

# 4) იგივე სიის მე-3 ინდექსზე მყოფი ელემენტი შეცვალეთ თქვენი სახელით და დაბეჭდეთ მთლიანი სია.

arr4 = ["Sushi", "Ramen", "Pizza", "Oto", "Shawarma"]

print(arr4)

# 5) შექმენით 3 ელემენტიანი რიცხვების სია და დაბეჭდეთ პირველი და ბოლო ელემენტის ჯამი ინდექსების გამოყენებით

arr5 = [4,8,12]

total = arr5[0] + arr5[2]

print(total)

# 6) შექმენით 7 ელემენტიანი სახელების სია და შეცვალეთ მასში 1-ლი და მე-5 ინდექსზე მყოფი ელემენტები სხვა ნებისმიერი სახელით. შემდეგ დაბეჭდეთ განახლებული სია.

arr6 = ['Oto', "Nika", "Davit", "Mari", "Salome", "Marina", "Dato"]

arr6[1] = "Ela"
arr6[5] = "Tamuna"

print(arr6)